app/views/books/index.html.erb

        <td>
          <p>コメント数:<%= book.book_comments.count %></p>
---
SELECT "books".* FROM "books"