app/views/books/show.html.erb

          <td><%= @book.body %></td>
          <td><p>コメント数:<%= @book.book_comments.count %></p></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]