app/controllers/book_comments_controller.rb

  def create
    book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = book.id
    comment.save
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaa"], ["user_id", 1], ["book_id", 1], ["created_at", "2022-04-12 08:55:02.087362"], ["updated_at", "2022-04-12 08:55:02.087362"]]

  def destroy
    BookComment.find_by(book_id: params[:book_id]).destroy
---
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]